TKJElectronics/Balanduino/Arduino code/hardware/Balanduino/variants/standard/pins_arduino.h
/*
  pins_arduino.h - Pin definition functions for Arduino
  Part of Arduino - http://www.arduino.cc/

  Copyright (c) 2007 David A. Mellis

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General
  Public License along with this library; if not, write to the
  Free Software Foundation, Inc., 59 Temple Place, Suite 330,
  Boston, MA  02111-1307  USA

  $Id: wiring.h 249 2007-02-03 16:52:51Z mellis $

  Changelog
  -----------
  11/25/11  - ryan@ryanmsutton.com - Add pins for Sanguino 644P and 1284P
  07/15/12  - ryan@ryanmsutton.com - Updated for arduino0101
  01/26/13  - kristianl@tkjelectronics.com - Changed to work with Balanduino
*/

#ifndef Pins_Arduino_h
#define Pins_Arduino_h

#include <avr/pgmspace.h>

const static uint8_t SS   = 6;
// Husk at ændre
const static uint8_t MOSI = 0;
const static uint8_t MISO = 0;
const static uint8_t SCK  = 0;

static const uint8_t SDA = 14;
static const uint8_t SCL = 13;
static const uint8_t LED_BUILTIN = 6;

static const uint8_t A0 = 7;
static const uint8_t A1 = 8;
static const uint8_t A2 = 9;
static const uint8_t A3 = 10;
static const uint8_t A4 = 11;
static const uint8_t A5 = 12;

// ATMEL ATMEGA644A / Balanduino
//
//                    +---\/---+
//      M2A () PB0  1|        |40 PA0 (A0 / D7)
//      M2B () PB1  2|        |39 PA1 (A1 / D8)
//   INT2 (D2) PB2  3|        |38 PA2 (A2 / D9)
// BUZZER (D5) PB3  4|        |37 PA3 (A3 / D10)
//    LED (D6) PB4  5|        |36 PA4 (A4 / D11)
//     MOSI () PB5  6|        |35 PA5 (A5 / D12)
//     MISO () PB6  7|        |34 PA6 () EN1B
//      SCK () PB7  8|        |33 PA7 () EN2B
//             RST  9|        |32 AREF
//             VCC 10|        |31 GND 
//             GND 11|        |30 AVCC
//           XTAL2 12|        |29 PC7 () M1B
//           XTAL1 13|        |28 PC6 () M1A
//     RX (D0) PD0 14|        |27 PC5 () M2EN
//     TX (D1) PD1 15|        |26 PC4 () M1EN
//     EN1A () PD2 16|        |25 PC3 () SS
//     EN2A () PD3 17|        |24 PC2 () INT_MAX
//    PWM1B () PD4 18|        |23 PC1 (D14) SDA
//    PWM1A () PD5 19|        |22 PC0 (D13) SCL
//  PWM2B (D3) PD6 20|        |21 PD7 (D4) PWM2A
//                   +--------+
//

// Husk at ændre
#define NUM_DIGITAL_PINS            7
#define NUM_ANALOG_INPUTS           6
#define analogInputToDigitalPin(p)  ((p < 6) ? (p) + 7 : -1)

// Husk at ændre - der er seks i alt
#define digitalPinHasPWM(p)         ((p) == 3 || (p) == 4 || (p) == 5 || (p) == 6)

#ifdef ARDUINO_MAIN
// these arrays map port names (e.g. port B) to the
// appropriate addresses for various functions (e.g. reading
// and writing)
const uint16_t PROGMEM port_to_mode_PGM[] = {
        NOT_A_PORT,
        (uint16_t) &DDRA,
        (uint16_t) &DDRB,
        (uint16_t) &DDRC,
        (uint16_t) &DDRD
};

const uint16_t PROGMEM port_to_output_PGM[] = {
        NOT_A_PORT,
        (uint16_t) &PORTA,
        (uint16_t) &PORTB,
        (uint16_t) &PORTC,
        (uint16_t) &PORTD
};
const uint16_t PROGMEM port_to_input_PGM[] = {
        NOT_A_PORT,
        (uint16_t) &PINA,
        (uint16_t) &PINB,
        (uint16_t) &PINC,
        (uint16_t) &PIND
};
const uint8_t PROGMEM digital_pin_to_port_PGM[] = {
        PD, /* 0  - PD0 */
        PD, /* 1  - PD1 */
        PB, /* 2  - PB2 */
        PD, /* 3  - PD6 */
        PD, /* 4  - PD7 */
        PB, /* 5  - PB3 */
        PB, /* 6  - PB4 */
        PA, /* 7  - PA0 */
        PA, /* 8  - PA1 */
        PA, /* 9  - PA2 */
        PA, /* 10 - PA3 */
        PA, /* 11 - PA4 */
        PA, /* 12 - PA5 */
        PC, /* 13 - PC0 */
        PC, /* 14 - PC1 */

        // Husk at ændre
        PB,
        PC, /* 16 */
        PC,
        PC,
        PC,
        PC,
        PC,
        PC,
        PC,
        PA, /* 24 */
        PA,
        PA,
        PA,
        PA,
        PA,
        PA,
        PA  /* 31 */
};
const uint8_t PROGMEM digital_pin_to_bit_mask_PGM[] = {
        _BV(0), /* 0  - PD0 */
        _BV(1), /* 1  - PD1 */
        _BV(2), /* 2  - PB2 */
        _BV(6), /* 3  - PD6 */
        _BV(7), /* 4  - PD7 */
        _BV(3), /* 5  - PB3 */
        _BV(4), /* 6  - PB4 */
        _BV(0), /* 7  - PA0 */
        _BV(1), /* 8  - PA1 */
        _BV(2), /* 9  - PA2 */
        _BV(3), /* 10 - PA3 */
        _BV(4), /* 11 - PA4 */
        _BV(5), /* 12 - PA5 */
        _BV(0), /* 13 - PC0 */
        _BV(1), /* 14 - PC1 */

        // Husk at ændre
        _BV(0),
        _BV(0), /* 16 */
        _BV(1),
        _BV(2),
        _BV(3),
        _BV(4),
        _BV(5),
        _BV(6),
        _BV(7),
        _BV(7), /* 24 */
        _BV(6),
        _BV(5),
        _BV(4),
        _BV(3),
        _BV(2),
        _BV(1),
        _BV(0)
};
const uint8_t PROGMEM digital_pin_to_timer_PGM[] = {
        NOT_ON_TIMER,   /* 0  - PD0 */
        NOT_ON_TIMER,   /* 1  - PD1 */
        NOT_ON_TIMER,   /* 2  - PB2 */
        TIMER2B,        /* 3  - PD6 */
        TIMER2A,        /* 4  - PD7 */
        TIMER0A,        /* 5  - PB3 */
        TIMER0B,        /* 6  - PB4 */
        NOT_ON_TIMER,   /* 7  - PA0 */
        NOT_ON_TIMER,   /* 8  - PA1 */
        NOT_ON_TIMER,   /* 9  - PA2 */
        NOT_ON_TIMER,   /* 10 - PA3 */
        NOT_ON_TIMER,   /* 11 - PA4 */
        NOT_ON_TIMER,   /* 12 - PA5 */
        NOT_ON_TIMER,   /* 13 - PC0 */
        NOT_ON_TIMER,   /* 14 - PC1 */

        // Husk at ændre
        TIMER2A,        /* 15 - PD7 */
        NOT_ON_TIMER,   /* 16 - PC0 */
        NOT_ON_TIMER,   /* 17 - PC1 */
        NOT_ON_TIMER,   /* 18 - PC2 */
        NOT_ON_TIMER,   /* 19 - PC3 */
        NOT_ON_TIMER,   /* 20 - PC4 */
        NOT_ON_TIMER,   /* 21 - PC5 */
        NOT_ON_TIMER,   /* 22 - PC6 */
        NOT_ON_TIMER,   /* 23 - PC7 */
        NOT_ON_TIMER,   /* 24 - PA0 */
        NOT_ON_TIMER,   /* 25 - PA1 */
        NOT_ON_TIMER,   /* 26 - PA2 */
        NOT_ON_TIMER,   /* 27 - PA3 */
        NOT_ON_TIMER,   /* 28 - PA4 */
        NOT_ON_TIMER,   /* 29 - PA5 */
        NOT_ON_TIMER,   /* 30 - PA6 */
        NOT_ON_TIMER   /* 31 - PA7 */
};
#endif
#endif